run/DA0120/DA0120Gas/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/data/ablParams"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    vapourInlet
    {
        type            zeroGradient;
    }
    frontField
    { 
        type            fixedValue;
        value           $internalField;
    }
    backField
    {
        type            zeroGradient;
    }
    sideField
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    ground
    {
        type            zeroGradient;
    }
    symPlane
    {
        type            symmetryPlane;
    }
}
// ************************************************************************* //
