run/DA0120/DA0120Gas/constant/reactions
species
(
    air
    SF6 
);

reactions
{}

